rails-task-api-web-app/app/controllers/api/v1/auth_controller.rb

      def signup
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("created_at", "email", "name", "password_digest", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2026-04-07 13:27:50.524686"], ["email", "[FILTERED]"], ["name", "テストユーザー"], ["password_digest", "[FILTERED]"], ["updated_at", "2026-04-07 13:27:50.524686"]]