rails-task-api-web-app/app/controllers/api/v1/projects_controller.rb

      def create
        @project = current_user.projects.build(project_params)
        if @project.save
---
INSERT INTO "projects" ("created_at", "description", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2026-04-07 13:27:51.160212"], ["description", nil], ["title", "新プロジェクト"], ["updated_at", "2026-04-07 13:27:51.160212"], ["user_id", 9]]

      def update
        if @project.update(project_params)
---
UPDATE "projects" SET "title" = $1, "updated_at" = $2 WHERE "projects"."id" = $3  [["title", "更新後"], ["updated_at", "2026-04-07 13:27:51.189655"], ["id", 9]]

      def set_project
        @project = current_user.projects.find(params[:id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = $1 AND "projects"."id" = $2 LIMIT $3  [["user_id", 12], ["id", 10], ["LIMIT", 1]]