rails-task-api-web-app/app/controllers/api/v1/tasks_controller.rb

      def create
        @task = @project.tasks.build(task_params)
        if @task.save
---
INSERT INTO "tasks" ("created_at", "due_date", "project_id", "status", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", "2026-04-07 13:27:51.272155"], ["due_date", nil], ["project_id", 13], ["status", 0], ["title", "新タスク"], ["updated_at", "2026-04-07 13:27:51.272155"]]

      def update
        if @task.update(task_params)
---
UPDATE "tasks" SET "status" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["status", 1], ["updated_at", "2026-04-07 13:27:51.294274"], ["id", 6]]

      def set_project
        @project = current_user.projects.find(params[:project_id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = $1 AND "projects"."id" = $2 LIMIT $3  [["user_id", 18], ["id", 16], ["LIMIT", 1]]

      def set_task
        @task = @project.tasks.find(params[:id])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = $1 AND "tasks"."id" = $2 LIMIT $3  [["project_id", 16], ["id", 7], ["LIMIT", 1]]